# Understanding your Data

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('railway_train_dataset.csv')

In [3]:
df.head()

,Train_Number,Train_Name,Source_Station,Destination_Station,Departure_Time,Arrival_Time,Distance_km,Duration_hr,Days_of_Operation
0,12001,Shatabdi Express,New Delhi,Bhopal,06:00,13:30,707,7.5,"Mon, Wed, Fri"
1,12002,Rajdhani Express,Mumbai Central,Delhi,16:25,08:45,1384,16.3,Daily
2,12003,Duronto Express,Howrah,Pune,20:00,12:30,1926,16.5,"Tue, Thu, Sat"
3,12004,Garib Rath,Chennai Central,Bangalore,06:10,14:00,496,7.8,"Mon, Wed, Fri, Sun"
4,12005,Jan Shatabdi,Bengaluru,Mysuru,07:30,11:45,143,4.2,Daily

# 1. How big is the data?

In [4]:
df.shape

(10, 9)

# how does the data look like ?

In [6]:
df.sample(5)

,Train_Number,Train_Name,Source_Station,Destination_Station,Departure_Time,Arrival_Time,Distance_km,Duration_hr,Days_of_Operation
6,12007,Humsafar Express,Ahmedabad,Jaipur,22:00,10:15,632,12.25,"Wed, Fri, Sun"
3,12004,Garib Rath,Chennai Central,Bangalore,06:10,14:00,496,7.80,"Mon, Wed, Fri, Sun"
4,12005,Jan Shatabdi,Bengaluru,Mysuru,07:30,11:45,143,4.20,Daily
7,12008,Tejas Express,Lucknow,Kanpur,05:50,09:10,290,3.33,Daily
1,12002,Rajdhani Express,Mumbai Central,Delhi,16:25,08:45,1384,16.30,Daily

# What is the data type of cols?

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Train_Number         10 non-null     int64
 1   Train_Name           10 non-null     object
 2   Source_Station       10 non-null     object
 3   Destination_Station  10 non-null     object
 4   Departure_Time       10 non-null     object
 5   Arrival_Time         10 non-null     object
 6   Distance_km          10 non-null     int64
 7   Duration_hr          10 non-null     float64
 8   Days_of_Operation    10 non-null     object
dtypes: float64(1), int64(2), object(6)
memory usage: 852.0+ bytes

# 4.Are there is any missing values?

In [9]:
df.isnull().sum()

Train_Number           0
Train_Name             0
Source_Station         0
Destination_Station    0
Departure_Time         0
Arrival_Time           0
Distance_km            0
Duration_hr            0
Days_of_Operation      0
dtype: int64

# 5.How does the data look mathematically?

In [10]:
df.describe()

       Train_Number  Distance_km  Duration_hr
count      10.00000     10.00000    10.000000
mean    12005.50000    786.20000     8.770000
std         3.02765    523.69792     4.753228
min     12001.00000    143.00000     3.330000
25%     12003.25000    527.75000     5.165000
50%     12005.50000    669.50000     7.650000
75%     12007.75000    860.25000    11.352500
max     12010.00000   1926.00000    16.500000

# 6.Are there duplicates values?

In [11]:
df.duplicated().sum()

0

# 7.How is the correlation between cols?

In [14]:
df.corr()

ValueError: could not convert string to float: 'Shatabdi Express'